SM_для_EDT/src/InformationRegisters/рарусОчередьОбработкиДублей/рарусОчередьОбработкиДублей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рарусОчередьОбработкиДублей</name>
  <resources>
    <name>Оригинал</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </resources>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОшибкаТекст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>КодУзла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дубль</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/vftТаблицаМорскихРасстояний/vftТаблицаМорскихРасстояний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>vftТаблицаМорскихРасстояний</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктОтправления</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктСледования</name>
    <type>
      <types>CatalogRef.vftПунктыСледования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SM_для_EDT/src/InformationRegisters/рарусОчередьОбработкиДублей/ManagerModule.bsl
&НаСервере
Функция ПолучитьНормыСледования(ТекущийПункт, ПредыдущийПункт, ПроектСудна, ГрузБалласт, ОсновноеСудно) Экспорт
	
	//raruskzn AydaFZ 15.11.2019{
	//Добавил параметр ОсновноеСудно 
	//raruskzn AydaFZ 15.11.2019 }

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПункт",ТекущийПункт);
	Запрос.УстановитьПараметр("ПредыдущийПункт",ПредыдущийПункт);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	//raruskzn AydaFZ 15.11.2019{
	Запрос.УстановитьПараметр("ОсновноеСудно", ОсновноеСудно);

	Запрос.Текст = "ВЫБРАТЬ
	               |	vftТаблицаМорскихРасстоянийСрезПоследних.Расстояние КАК Расстояние
	               |ИЗ
	               |	РегистрСведений.vftТаблицаМорскихРасстояний.СрезПоследних(
	               |			&Дата,
	               |			ПунктОтправления = &ПредыдущийПункт
	               |				И ПунктСледования = &ТекущийПункт
	               |				И Судно = &ОсновноеСудно) КАК vftТаблицаМорскихРасстоянийСрезПоследних";
	//raruskzn AydaFZ 15.11.2019}
	Результат = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата = Новый Структура;
	Если ГрузБалласт Тогда
		Время = ?(Результат.Количество()=0,0,Результат[0].Расстояние/ПроектСудна.СредняяСкоростьНаМореВГрузу);
	Иначе
		Время = ?(Результат.Количество()=0,0,Результат[0].Расстояние/ПроектСудна.СредняяСкоростьНаМореВБалласте);
	КонецЕсли; 	
	СтруктураВозврата.Вставить("Время", Время*60);
	СтруктураВозврата.Вставить("Расстояние", ?(Результат.Количество()=0,0,Результат[0].Расстояние));
	
	Возврат СтруктураВозврата;	
КонецФункции
